#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_compute_disk.db will be created
  + resource "google_compute_disk" "db" {
      + creation_timestamp        = (known after apply)
      + id                        = (known after apply)
      + label_fingerprint         = (known after apply)
      + last_attach_timestamp     = (known after apply)
      + last_detach_timestamp     = (known after apply)
      + name                      = "db"
      + physical_block_size_bytes = (known after apply)
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + size                      = 5
      + source_image_id           = (known after apply)
      + source_snapshot_id        = (known after apply)
      + type                      = "pd-standard"
      + users                     = (known after apply)
      + zone                      = "northamerica-northeast1-a"
    }

  # google_compute_instance.chat will be updated in-place
  ~ resource "google_compute_instance" "chat" {
        allow_stopping_for_update = true
        can_ip_forward            = false
        cpu_platform              = "Intel Skylake"
        deletion_protection       = false
        enable_display            = false
        guest_accelerator         = []
        id                        = "projects/cmc-things/zones/northamerica-northeast1-a/instances/chat"
        instance_id               = "7005660465973133096"
        label_fingerprint         = "42WmSpB8rSM="
        labels                    = {}
        machine_type              = "n1-standard-1"
        metadata                  = {}
        metadata_fingerprint      = "h6puCjWMsaY="
        metadata_startup_script   = "#!/bin/bash\n\nset -euo pipefail\n\necho \"Hello, world!\"\n\nif [ ! -f GCSFUSE_IS_INSTALLED ]; then\n  echo \"Installing gcsfuse\"\n  GCSFUSE_REPO=gcsfuse-$(lsb_release -c -s)\n  echo \"deb http://packages.cloud.google.com/apt $GCSFUSE_REPO main\" | tee /etc/apt/sources.list.d/gcsfuse.list\n  curl https://packages.cloud.google.com/apt/doc/apt-key.gpg | apt-key add -\n\n  apt-get update\n  apt-get install -y gcsfuse\n  touch GCSFUSE_IS_INSTALLED\nfi\n\nif [ ! -f DOCKER_COMPOSE_IS_INSTALLED ]; then\n  echo \"Installing docker-compose\"\n  apt-get install -y docker-compose\n  touch DOCKER_COMPOSE_IS_INSTALLED\nfi\n\nif ! id -u synapse > /dev/null 2>&1; then\n  echo \"Creating the synapse user\"\n  groupadd -g 1337 synapse\n  # TODO: use rootless docker\n  useradd -m -u 1337 -g synapse -G docker synapse\nfi\n\necho \"Creating the mount point for keys\"\nmkdir -p /home/synapse/keys\nchown synapse:synapse /home/synapse/keys\n\n# Mount as root with allow_other which isn't great...\n# TODO: move to rootless docker so that we don't need to do this\necho \"Mounting the keys bucket\"\ngcsfuse --file-mode 600 --uid 1337 -o allow_other cmc-chat-keys /home/synapse/keys\n\necho \"Switching to synapse user\"\nsudo -u synapse /bin/bash <<EOF\n  cd /home/synapse\n  \n  export GIT_SSH_COMMAND='ssh -i ~/keys/github/deploy_key'\n  mkdir -p .ssh\n  ssh-keyscan github.com >> .ssh/known_hosts # YOLO\n  if [ -d \"cmc\" ]; then\n    echo \"Repo directory exists; pulling\"\n    cd cmc\n    git pull origin master\n  else\n    echo \"Cloning repo\"\n    git clone ssh://git@github.com/j3parker/cmc\n    cd cmc\n  fi \n\n  echo \"Starting containers\"\n  cd chat\n  docker-compose up --build\nEOF\n"
        name                      = "chat"
        project                   = "cmc-things"
        self_link                 = "https://www.googleapis.com/compute/v1/projects/cmc-things/zones/northamerica-northeast1-a/instances/chat"
        tags                      = [
            "web",
        ]
        tags_fingerprint          = "3d9fNIIa_10="
        zone                      = "northamerica-northeast1-a"

      + attached_disk {
          + device_name = "db"
          + mode        = "READ_WRITE"
          + source      = (known after apply)
        }

        boot_disk {
            auto_delete = true
            device_name = "persistent-disk-0"
            mode        = "READ_WRITE"
            source      = "https://www.googleapis.com/compute/v1/projects/cmc-things/zones/northamerica-northeast1-a/disks/chat"

            initialize_params {
                image  = "https://www.googleapis.com/compute/v1/projects/gce-uefi-images/global/images/ubuntu-1804-bionic-v20191113"
                labels = {}
                size   = 10
                type   = "pd-standard"
            }
        }

        network_interface {
            name               = "nic0"
            network            = "https://www.googleapis.com/compute/v1/projects/cmc-things/global/networks/default"
            network_ip         = "10.162.0.16"
            subnetwork         = "https://www.googleapis.com/compute/v1/projects/cmc-things/regions/northamerica-northeast1/subnetworks/default"
            subnetwork_project = "cmc-things"

            access_config {
                nat_ip       = "34.95.33.143"
                network_tier = "PREMIUM"
            }
        }

        scheduling {
            automatic_restart   = true
            on_host_maintenance = "MIGRATE"
            preemptible         = false
        }

        service_account {
            email  = "655324115206-compute@developer.gserviceaccount.com"
            scopes = [
                "https://www.googleapis.com/auth/devstorage.full_control",
            ]
        }

        shielded_instance_config {
            enable_integrity_monitoring = true
            enable_secure_boot          = false
            enable_vtpm                 = true
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Test`, Action: `hashicorpterraform-github-actions3`, Working Directory: `terraform`*
